{
        "auth/claims-too-large": "The claims payload is too large. Please reduce the size.",
        "auth/email-already-in-use": "The provided email is already in use. Please use a different email.",
        "auth/id-token-expired": "Your session has expired. Please log in again.",
        "auth/id-token-revoked": "Your session has been revoked. Please log in again.",
        "auth/insufficient-permission": "You do not have permission to perform this action.",
        "auth/internal-error": "An internal error occurred. Please try again later.",
        "auth/invalid-argument": "An invalid argument was provided. Please check your input.",
        "auth/invalid-claims": "The custom claim attributes are invalid. Please check your input.",
        "auth/invalid-continue-uri": "The continue URL provided is not valid.",
        "auth/invalid-creation-time": "The creation time must be a valid date.",
        "auth/invalid-credential": "Invalid email or password. Please check again.",
        "auth/invalid-disabled-field": "The value for the disabled user property is invalid. It must be a boolean.",
        "auth/invalid-display-name": "The display name must be a non-empty string.",
        "auth/invalid-dynamic-link-domain": "The dynamic link domain is not configured for your project.",
        "auth/invalid-email": "The provided email address is invalid. Please enter a valid email.",
        "auth/invalid-email-verified": "The email verified property must be a boolean.",
        "auth/invalid-hash-algorithm": "The hash algorithm must match one of the supported algorithms.",
        "auth/invalid-hash-block-size": "The hash block size must be a valid number.",
        "auth/invalid-hash-derived-key-length": "The derived key length must be a valid number.",
        "auth/invalid-hash-key": "The hash key must be a valid byte buffer.",
        "auth/invalid-hash-memory-cost": "The hash memory cost must be a valid number.",
        "auth/invalid-hash-parallelization": "The hash parallelization must be a valid number.",
        "auth/invalid-hash-rounds": "The hash rounds must be a valid number.",
        "auth/invalid-hash-salt-separator": "The hashing algorithm salt separator must be a valid byte buffer.",
        "auth/invalid-id-token": "The provided ID token is invalid. Please log in again.",
        "auth/invalid-last-sign-in-time": "The last sign-in time must be a valid date.",
        "auth/invalid-page-token": "The provided page token is invalid.",
        "auth/invalid-password": "The password must be at least six characters long.",
        "auth/invalid-password-hash": "The password hash must be a valid byte buffer.",
        "auth/invalid-password-salt": "The password salt must be a valid byte buffer.",
        "auth/invalid-phone-number": "The provided phone number is invalid. Please enter a valid phone number.",
        "auth/invalid-photo-url": "The photo URL must be a valid URL.",
        "auth/invalid-provider-data": "The provider data must be a valid array of UserInfo objects.",
        "auth/invalid-provider-id": "The provider ID must be a valid supported identifier.",
        "auth/invalid-oauth-responsetype": "Only one OAuth responseType should be set to true.",
        "auth/invalid-session-cookie-duration": "The session cookie duration must be between 5 minutes and 2 weeks.",
        "auth/invalid-uid": "The UID must be a non-empty string with a maximum of 128 characters.",
        "auth/invalid-user-import": "The user record to import is invalid.",
        "auth/maximum-user-count-exceeded": "The maximum allowed number of users to import has been exceeded.",
        "auth/missing-android-pkg-name": "An Android Package Name must be provided.",
        "auth/missing-continue-uri": "A valid continue URL must be provided.",
        "auth/missing-hash-algorithm": "Hashing algorithm and its parameters must be provided for importing users.",
        "auth/missing-ios-bundle-id": "A Bundle ID is required.",
        "auth/missing-uid": "A UID identifier is required for this operation.",
        "auth/missing-oauth-client-secret": "The OAuth client secret is required for enabling OIDC code flow.",
        "auth/operation-not-allowed": "This sign-in provider is disabled. Enable it in the Firebase console.",
        "auth/phone-number-already-exists": "The provided phone number is already in use.",
        "auth/project-not-found": "No Firebase project found for the provided credentials.",
        "auth/reserved-claims": "One or more custom claims are reserved and cannot be used.",
        "auth/session-cookie-expired": "The session cookie has expired. Please log in again.",
        "auth/session-cookie-revoked": "The session cookie has been revoked. Please log in again.",
        "auth/too-many-requests": "You have made too many requests. Please try again later.",
        "auth/uid-already-exists": "The provided UID is already in use. Please use a different UID.",
        "auth/unauthorized-continue-uri": "The domain of the continue URL is not whitelisted. Please check the Firebase Console.",
        "auth/user-not-found": "No user found for the provided identifier. Please check your email or phone number."
}